trade_exp/src/Documents/ЗаказНаДоставкуОтПоставщика/ЗаказНаДоставкуОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаДоставкуОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9108def1-74b6-49f6-826d-411b4f378a62">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf2dbe71-1e2e-44dd-8f86-3a17b80c2b50">
    <name>ПрибытиеНаВыгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="80353671-e282-4b56-8dce-2a57668ab838">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dfe24e2d-676b-48a5-a9b8-3c5f0b13acc6">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="455e72aa-afaf-45cd-9f49-31780b117de1">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88892e7e-ed4c-4ff9-9e78-07befff4e04a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a2e9879-cef7-42dd-905f-482b6a2f455a">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="86982b60-862a-4887-ba01-a08bc79f03c6">
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f108f560-b4a5-4574-bd00-9c07fe772f24">
    <name>СтоимостьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9430bac8-9a15-40d7-aa10-3adfdb59c859">
    <name>ТранзитФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fcf9d9ba-0906-4ffc-9e5e-737f64099517">
    <name>ПрибытиеНаПогрузку</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d780eac6-c9c8-4c2f-852c-10736a66bfd6">
    <name>ИнтервалНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2044c9b2-8129-4e36-9f45-71da4032cde7">
    <name>ВремяНаПогрузкеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="735e0970-9985-412c-a81f-2c90d6cb07d3">
    <name>МаксимальнаяДлина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7b12af0-6c5d-49b7-a923-925de351a6bf">
    <name>НаименованиеГруза</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0258e270-c945-45b7-9b29-400d7f52e81c">
    <name>ВремяНаВыгрузкеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb5d3130-09a9-492d-b99b-014e0a261c51">
    <name>ВремяНаПогрузкеПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0143b187-4422-4fe8-969a-7ba96e241605">
    <name>АдресНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f56e03a7-c4af-4ed3-b43a-e18714951dd2">
    <name>ТелефонНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="52d79523-9883-43fe-aed3-302fe7eb6ebe">
    <name>ИнтервалНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0375cd-d0c9-4885-97e6-dfa91b0458f7">
    <name>ВремяНаВыгрузкеПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fe254e26-2b30-4311-a001-839a5b565611">
    <name>КоличествоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c30b0ea6-027c-49fa-8637-dc11fd260b8c">
    <name>КонтрагентКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d40ac935-ba6c-4dfc-95dc-42dd2c509023">
    <name>ФилиалВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84a4d445-3c12-4ced-b011-00a1d0cc5f10">
    <name>АдресНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fe589a13-9652-4e80-a67c-daaecc2e76dc">
    <name>ТелефонНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="03649d03-61d7-4d00-aad8-b57d6b16b8cc">
    <name>СсылкаБитрикс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fb39d2e-07c5-4a8e-91cd-fbeecd9241ff">
    <name>Транзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec493491-1e4b-4c54-afa5-c6540c966861">
    <name>СтоимостьТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a47fe91-e454-4a30-948a-b860a45251f9">
    <name>НаправлениеДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7b68ea76-f8ba-4e00-a6e6-0bfa3d88a69d">
    <name>ДоверенностьНаСумму</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="331761b3-207b-4f40-b3a4-cfa35eae35cb">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3eeb0f84-a6a0-44ea-bc0e-3a7c773ae588">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf76a4e-cc67-4e12-871f-a782770ccfd1">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c16b4556-8131-40e1-b044-7e7acc8ab2d6">
    <name>КоличествоДнейНаВывозЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="481ac138-6530-4efd-abc8-d5cb7f871411">
    <name>ПоДокументу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="a848cef6-15c4-4d0f-8f9f-3ccb4cf548c2">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bae39f0f-a7b4-46fc-afc5-0fc2017cb0ee">
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/ЗаказыКДоставкеОтПоставщика/ЗаказыКДоставкеОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="50a3f077-bb00-4b3c-b903-1f8e8c12863e">
  <name>ЗаказыКДоставкеОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="e8c86484-2d9c-456e-9712-89af750bfba4">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="187706c0-aafe-470e-8971-fbe20c0f1360">
    <name>ЗаказНаДоставку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ec5f0146-6d60-4055-83fd-72118391b753">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Enums/СтатусыДоверенностей/СтатусыДоверенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a5c13e11-94ac-4827-907d-7b0fc8b6f32c">
  <name>СтатусыДоверенностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="fcd4bdce-aed3-43db-a8a9-9e3b9743c060">
    <name>Аннулирована</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="48502f76-0855-494d-9da6-c522e9e66fe4">
    <name>ИспользованаЧастично</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5931bb1a-1c53-4ebd-ace1-813ecf62d479">
    <name>НеВыдана</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d2eb46c4-0851-44f9-914c-5c59e358349e">
    <name>Выдана</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c0953254-7e03-43d0-87f0-b2d4d9ee29a4">
    <name>НеИспользована</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0d9bd674-a785-46c2-9090-0a131fb9ac5d">
    <name>Использована</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыВыданныхДоверенностей/ТипыВыданныхДоверенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9cf02dc6-2951-47f8-a1cb-6da632e85c01">
  <name>ТипыВыданныхДоверенностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a4250fed-e923-41bd-bb00-1c84a5b6ad39">
    <name>НаПолучениеТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e7539411-2467-458f-a079-28f296e32a33">
    <name>НаПолучениеДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4fe362f1-4084-4644-adb0-fb27097157f3">
    <name>НаПолучениеПрочихМатериальныхЦенностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЗаказНаДоставкуОтПоставщика/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Заполнение 

Процедура ЗаполнитьДанныеПоОснованию(Основания, Объект)   Экспорт
	
	мОснований= Новый Массив;
	Если ТипЗнч(Основания) = Тип("Массив") Тогда
		мОснований= Основания;
	Иначе
		мОснований.Добавить(Основания);
	КонецЕсли;
	
	Для Каждого Основание Из мОснований Цикл
		Если ЗначениеЗаполнено(Основание) Тогда
			ТЗОснований= Объект.Основания.Выгрузить();
			НоваяСтрока= ТЗОснований.Найти(Основание, "Документ");
			Если НоваяСтрока= Неопределено Тогда 
				НоваяСтрока= Объект.Основания.Добавить();
				НоваяСтрока.Документ= Основание;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Объект, Основание, , "Дата,Номер,Проведен,Комментарий");
			Объект.ФилиалВыгрузки= Основание.Склад.Подразделение;
			Если ТипЗнч(Основание)  = Тип("ДокументСсылка.ЗаказПоставщику") ИЛИ ТипЗнч(Основание)  = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
				Объект.НаправлениеДоставки= Основание.Партнер.БизнесРегион;
				ОбновитьРеквизитыДоставки(Объект);
			КонецЕсли;
			
			Объект.Автор= Пользователи.ТекущийПользователь();
			
			ОбновитьИтогиПоОснованиям(Объект);
		КонецЕсли;
	КонецЦикла;
	
	Если мОснований.Количество() > 0 Тогда
		ЗаказПоставщику= мОснований[0];
		Если ТипЗнч(ЗаказПоставщику) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ЗаказКлиента= ЗаказПоставщику.ДокументОснование;
			Если ЗначениеЗаполнено(ЗаказКлиента) И ТипЗнч(ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				Объект.Транзит= ЗаказКлиента.Склад.Транзит;
				Объект.ТранзитФизЛицо= ЗаказКлиента.ТранзитФизЛицо;
				Объект.Клиент= ЗаказКлиента.Партнер;
				Объект.КонтрагентКлиента= ЗаказКлиента.Контрагент;
				Объект.ТелефонНаВыгрузке= ЗаказКлиента.ТелефонКлиентаНаВыгрузке;
				Объект.АдресНаВыгрузке= ЗаказКлиента.АдресДоставки;
				Объект.АдресНаВыгрузкеЗначенияПолей= ЗаказКлиента.АдресДоставкиЗначенияПолей;
				Объект.СтоимостьДоставки= ЗаказКлиента.РазмерТранспортных;
				Объект.Комментарий= ЗаказКлиента.Комментарий;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьРеквизитыДоставки(Объект) Экспорт

	Объект.АдресНаПогрузке = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, ТекущаяДата());
	Объект.ТелефонНаПогрузке = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, ТекущаяДата());
	
	Объект.АдресНаВыгрузке = АльтерраОбщегоНазначения.ПолучитьАдресФилиала(Объект.ФилиалВыгрузки);     
	
КонецПроцедуры

Процедура ОбновитьИтогиПоОснованиям(Объект) Экспорт
	
	мСсылок = ПолучитьМассивОснований(Объект);
	
	Итоги = ПолучитьИтогиПоДокументам(мСсылок);
	
	ЗаполнитьЗначенияСвойств(Объект, Итоги);  
	
КонецПроцедуры

Функция ПолучитьМассивОснований(Объект)
	
	мСсылок = Новый Массив;
	Для Каждого стрОснование Из Объект.Основания Цикл
		мСсылок.Добавить(стрОснование.Документ);
	КонецЦикла;
	
	Возврат мСсылок;  
	
КонецФункции

Функция ПолучитьИтогиПоДокументам(мСсылок)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
	|	ПоступлениеТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСтрокВДокументе,
	|	ПоступлениеТоваровУслугТовары.Ссылка.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ Товар
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка В(&мСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Сумма,
	|	ЗаказПоставщикуТовары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЗаказПоставщикуТовары.Ссылка.СуммаДокумента
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В(&мСсылок)
	|	И НЕ ЗаказПоставщикуТовары.Отменено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаПеремещениеТовары.Номенклатура,
	|	0,
	|	ЗаказНаПеремещениеТовары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|ГДЕ
	|	ЗаказНаПеремещениеТовары.Ссылка В(&мСсылок)
	|	И НЕ ЗаказНаПеремещениеТовары.Отменено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	0,
	|	ПеремещениеТоваровТовары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&мСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.Номенклатура,
	|	-ВозвратТоваровПоставщикуТовары.Сумма,
	|	-ВозвратТоваровПоставщикуТовары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщикуТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	-ВозвратТоваровПоставщикуТовары.Ссылка.СуммаДокумента
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.Ссылка.ДокументПоступления В(&мСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Товар.Сумма) КАК СтоимостьТовара,
	|	СУММА(Товар.КоличествоУпаковок * &ТекстЗапросаВесНоменклатуры) КАК Вес,
	|	СУММА(Товар.КоличествоУпаковок * &ТекстЗапросаОбъемНоменклатуры) КАК Объем,
	|	СУММА(Товар.СуммаДокумента) КАК Стоимость,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Товар.Номенклатура.ДлинаЗнаменатель <> 0
	|				ТОГДА Товар.Номенклатура.ДлинаЧислитель / Товар.Номенклатура.ДлинаЗнаменатель
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК МаксимальнаяДлина
	|ИЗ
	|	Товар КАК Товар" ;
	
	Запрос.УстановитьПараметр("мСсылок", мСсылок);
	
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаВесНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
	"Товар.Номенклатура.ЕдиницаИзмерения",
	"Товар.Номенклатура"));
	Запрос.Текст = СтрЗаменить(
	Запрос.Текст, 
	"&ТекстЗапросаОбъемНоменклатуры",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
	"Товар.Номенклатура.ЕдиницаИзмерения",
	"Товар.Номенклатура"));
	
	Рез = Новый Структура("Вес,Объем,СтоимостьТовара,МаксимальнаяДлина,Стоимость",0,0,0,0);
	
	Выборка= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез, Выборка);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

#КонецОбласти

#Область Печать   

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	//
КонецПроцедуры

#КонецОбласти

#Область Вспомогательные 

Процедура УбратьПодстановкиИзКода(стрМакет) Экспорт
	
	стрМакет = СтрЗаменить(стрМакет, "#стрФункций#", "");
	стрМакет = СтрЗаменить(стрМакет, "#стрСобытий#", "");

КонецПроцедуры

Функция ПолучитьТоварыОснований(ЗаказНаДоставку)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка КАК Документ,
	|	ЗаказПоставщикуТовары.Ссылка.Контрагент КАК Контрагент,
	|	NULL КАК ПрибытиеНаОтгрузку,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказПоставщикуТовары.КоличествоУпаковок) КАК Количество,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказПоставщикуТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдИзм,
	|	СУММА(ЗаказПоставщикуТовары.Цена) КАК Цена,
	|	СУММА(ЗаказПоставщикуТовары.СуммаСНДС) КАК Сумма,
	|	СУММА(ЗаказПоставщикуТовары.СуммаНДС) КАК СуммаНДС,
	|	ЗаказПоставщикуТовары.Ссылка.Дата КАК Дата,
	|	ЗаказПоставщикуТовары.Номенклатура.Код КАК Код,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Склад.Ссылка, ЗаказПоставщикуТовары.Ссылка.Склад) КАК Склад,
	|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ЗаказПоставщикуТовары.Упаковка
	|		ИНАЧЕ ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК Упаковка
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказПоставщикуТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ЗаказПоставщикуТовары.Ссылка.Дата,
	|	ЗаказПоставщикуТовары.Ссылка.Контрагент,
	|	ЗаказПоставщикуТовары.Номенклатура.Код,
	|	ЗаказПоставщикуТовары.Склад,
	|	ЗаказПоставщикуТовары.Характеристика,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Склад.Ссылка, ЗаказПоставщикуТовары.Ссылка.Склад),
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ЗаказПоставщикуТовары.Упаковка
	|		ИНАЧЕ ЗаказПоставщикуТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент,
	|	NULL,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	СУММА(ПоступлениеТоваровУслугТовары.Цена),
	|	СУММА(ПоступлениеТоваровУслугТовары.СуммаСНДС),
	|	СУММА(ПоступлениеТоваровУслугТовары.СуммаНДС),
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Код,
	|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Склад.Ссылка, ПоступлениеТоваровУслугТовары.Ссылка.Склад),
	|	ПоступлениеТоваровУслугТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ПоступлениеТоваровУслугТовары.Упаковка
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Код,
	|	ПоступлениеТоваровУслугТовары.Склад,
	|	ПоступлениеТоваровУслугТовары.Характеристика,
	|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Склад.Ссылка, ПоступлениеТоваровУслугТовары.Ссылка.Склад),
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ПоступлениеТоваровУслугТовары.Упаковка
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Ссылка.Организация,
	|	ПеремещениеТоваровТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	СУММА(ПеремещениеТоваровТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
	|	ПеремещениеТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ПеремещениеТоваровТовары.Упаковка
	|		ИНАЧЕ ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Ссылка,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка.Дата,
	|	ПеремещениеТоваровТовары.Номенклатура.Код,
	|	ПеремещениеТоваровТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ПеремещениеТоваровТовары.Ссылка.Организация,
	|	ПеремещениеТоваровТовары.Ссылка.ПрибытиеНаОтгрузку,
	|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ПеремещениеТоваровТовары.Упаковка
	|		ИНАЧЕ ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ЗаказНаПеремещениеТовары.Ссылка.Организация,
	|	NULL,
	|	ЗаказНаПеремещениеТовары.Номенклатура,
	|	СУММА(ЗаказНаПеремещениеТовары.КоличествоУпаковок),
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказНаПеремещениеТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	ЗаказНаПеремещениеТовары.Ссылка.Дата,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Код,
	|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
	|	ЗаказНаПеремещениеТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ЗаказНаПеремещениеТовары.Упаковка
	|		ИНАЧЕ ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|ГДЕ
	|	ЗаказНаПеремещениеТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ЗаказНаПеремещениеТовары.Номенклатура,
	|	ЗаказНаПеремещениеТовары.Ссылка.Дата,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Код,
	|	ЗаказНаПеремещениеТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказНаПеремещениеТовары.Упаковка.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ЗаказНаПеремещениеТовары.Ссылка.Организация,
	|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Номенклатура.ИспользоватьУпаковки
	|			ТОГДА ЗаказНаПеремещениеТовары.Упаковка
	|		ИНАЧЕ ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.Количество) КАК КоличествоУпаковок,
	|	МАКСИМУМ(Товары.Цена) КАК Цена,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ_Товары КАК Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Упаковка,
	|	Товары.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("МассивДокументов", ЗаказНаДоставку.Основания.Выгрузить().ВыгрузитьКолонку("Документ"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти 

#Область Проверки
//Проведение
Процедура КонтрольОстатков(Объект, Отказ)  Экспорт
	
	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказНаДоставкуОтПоставщикаОснования.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ_Основания
	|ИЗ
	|	Документ.ЗаказНаДоставкуОтПоставщика.Основания КАК ЗаказНаДоставкуОтПоставщикаОснования
	|ГДЕ
	|	ЗаказНаДоставкуОтПоставщикаОснования.Ссылка = &Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыКДоставкеОтПоставщика.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ЗаказыКДоставкеОтПоставщика.Документ КАК Документ
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставкеОтПоставщика КАК ЗаказыКДоставкеОтПоставщика
	|ГДЕ
	|	ЗаказыКДоставкеОтПоставщика.Документ В
	|			(ВЫБРАТЬ
	|				ВТ_Основания.Документ КАК Основание
	|			ИЗ
	|				ВТ_Основания КАК ВТ_Основания)
	|	И ЗаказыКДоставкеОтПоставщика.ВидДвижения = &ВидДвижения
	|	И ЗаказыКДоставкеОтПоставщика.Регистратор <> &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Сообщить("Документы присутствуют в других заказах!");
		Отказ= Истина;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		АльтерраОбщегоНазначения.СообщитьПользователю(Выборка.ЗаказНаДоставку, Строка(Выборка.Документ));
	КонецЦикла; 
	
КонецПроцедуры

//Перед записью
Процедура ПроверитьЧтоЕстьДругиеЗаказы(Объект, Отказ)  Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Основания.Документ КАК Основание
	|ПОМЕСТИТЬ ВТ_Основания
	|ИЗ
	|	&Основания КАК ВТ_Основания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыКДоставке.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ЗаказыКДоставке.Документ КАК Документ
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставкеОтПоставщика КАК ЗаказыКДоставке
	|ГДЕ
	|	ЗаказыКДоставке.Документ В
	|			(ВЫБРАТЬ
	|				ВТ_Основания.Основание КАК Основание
	|			ИЗ
	|				ВТ_Основания КАК ВТ_Основания)
	|	И ЗаказыКДоставке.ЗаказНаДоставку <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Основания", Объект.Основания.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ: "+Выборка.Документ+" присутствует в другом заказе: "+Выборка.ЗаказНаДоставку, Объект.Ссылка, "ОснованияДокумент", "Основания.Документ");
		Отказ= Истина;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь); 
	
КонецПроцедуры   

//При отмене проведения
Процедура ПроверитьЧтоЕстьРейсы(Объект, Отказ)  Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Основания.Документ КАК Основание
	|ПОМЕСТИТЬ ВТ_Основания
	|ИЗ
	|	&Основания КАК ВТ_Основания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыКДоставкеОтПоставщика.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ЗаказыКДоставкеОтПоставщика.Документ КАК Документ
	|ИЗ
	|	РегистрНакопления.ЗаказыКДоставкеОтПоставщика КАК ЗаказыКДоставкеОтПоставщика
	|ГДЕ
	|	ЗаказыКДоставкеОтПоставщика.Документ В
	|			(ВЫБРАТЬ
	|				ВТ_Основания.Основание КАК Основание
	|			ИЗ
	|				ВТ_Основания КАК ВТ_Основания)
	|	И ЗаказыКДоставкеОтПоставщика.ЗаказНаДоставку <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Основания", Объект.Основания.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		АльтерраОбщегоНазначения.СообщитьПользователю(ВыборкаДетальныеЗаписи.ЗаказНаДоставку, "По " + ВыборкаДетальныеЗаписи.ЗаказНаДоставку + " существует активный рейс!");
		Отказ = Истина;                                                                                                                      
	КонецЦикла; 
	
КонецПроцедуры  

#КонецОбласти 

#Область СозданиеНаОсновании  

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	ИмяДокумента = "ЗаказНаДоставкуОтПоставщика";
	Если ПравоДоступа("Добавление", Метаданные.Документы[ИмяДокумента]) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы[ИмяДокумента].ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = Строка(ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы[ИмяДокумента])) + " (множественный выбор)";
		КомандаСоздатьНаОсновании.МножественныйВыбор= Истина;
		КомандаСоздатьНаОсновании.Идентификатор = "ЗаказНаДоставкуОтПоставщика_ЗаказПоставщику";
		КомандаСоздатьНаОсновании.Обработчик = "ВводНаОснованииДополнительноКлиент.ВводНаОснованииКлиент";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДоверенность(ЗаказНаДоставку, Водитель)  Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоверенностьВыданная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ДоверенностьВыданная КАК ДоверенностьВыданная
	|ГДЕ
	|	ДоверенностьВыданная.Проведен
	|	И ДоверенностьВыданная.ДокументОснование = &ЗаказНаДоставку
	|	И ДоверенностьВыданная.ФизЛицо = &Водитель";
	
	Запрос.УстановитьПараметр("ЗаказНаДоставку", ЗаказНаДоставку);
	Запрос.УстановитьПараметр("Водитель", Водитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка= РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ДоверенностьВыданная.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции 

Функция СоздатьДоверенность(ЗаказНаДоставку, Рейс)  Экспорт
	
	ДокДоверенность = Документы.ДоверенностьВыданная.СоздатьДокумент();
	ДокДоверенность.Дата = ТекущаяДата();
	ДокДоверенность.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ДокДоверенность.ДокументОснование = ЗаказНаДоставку;
	ДокДоверенность.Должность = "Водитель"; 
	ДокДоверенность.Комментарий = "На основании: "+ ЗаказНаДоставку;
	ДокДоверенность.Контрагент = ЗаказНаДоставку.Контрагент;
	ДокДоверенность.Организация = ЗаказНаДоставку.Организация;
	БанковскийСчет = АльтерраОбщегоНазначения.ПолучитьБанковскийСчетПоУмолчанию(ДокДоверенность.Организация);
	ДокДоверенность.БанковскийСчет = БанковскийСчет;
	ДокДоверенность.Ответственный = Пользователи.ТекущийПользователь();
	ДокДоверенность.Партнер = ЗаказНаДоставку.Партнер;
	ДокДоверенность.Статус = Перечисления.СтатусыДоверенностей.НеВыдана; 
	ДокДоверенность.СрокДействия = 10;
	ДокДоверенность.ДатаОкончанияДействия = ТекущаяДата()+3600*24*ДокДоверенность.СрокДействия;
	ДокДоверенность.СуммаДокумента = ЗаказНаДоставку.СтоимостьТовара;
	ДокДоверенность.СуммаОплатПоДокументу =  ЗаказНаДоставку.СтоимостьДоставки;
	ДокДоверенность.ФизЛицо = Рейс.Водитель;
	ДокДоверенность.ПоДокументу = ЗаказНаДоставку.ПоДокументу;
	
	СписокГрузополучателей = ПолучитьНастройкиХранилища("СоотвтетствиеСкладовИГрузополучатеей");
	СкладПолучатель = Рейс.РасчетДоставки[0].СкладРазгрузки;
	
	Для каждого Склад Из СписокГрузополучателей.ТаблицаНастройки Цикл
		Если Склад.СкладПолучатель = СкладПолучатель Тогда
			ДокДоверенность.Грузополучатель = Склад.Грузополучатель
		КонецЕсли;
	КонецЦикла;
		
	ЗаполнитьПаспортныеДанные(ДокДоверенность, ДокДоверенность.ФизЛицо);
	
	ОтветственныеЛица = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(ДокДоверенность.Организация, ДокДоверенность.Дата);
	ДокДоверенность.ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтерСсылка;
	ДокДоверенность.Руководитель = ОтветственныеЛица.РуководительСсылка;
	
	ДокДоверенность.ТипДоверенности = Перечисления.ТипыВыданныхДоверенностей.НаПолучениеТоваров;
	ДокДоверенность.Товары.Загрузить(Документы.ЗаказНаДоставкуОтПоставщика.ПолучитьТоварыОснований(ЗаказНаДоставку));
	
	ДокДоверенность.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокДоверенность.Ссылка;   
	
КонецФункции

Процедура ЗаполнитьПаспортныеДанные(ДокДоверенность, ФизЛицо) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ВидДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК СерияДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК НомерДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыданДокументФизлица,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачиДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Представление КАК ПредставлениеДокументаФизЛица
	|ПОМЕСТИТЬ ПаспортРФ
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|ГДЕ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо = &ФизЛицо
	|	И ДокументыФизическихЛицСрезПоследних.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ВидДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК СерияДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК НомерДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыданДокументФизлица,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачиДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Представление КАК ПредставлениеДокументаФизЛица
	|ПОМЕСТИТЬ ДокументУдостоверяющийЛичность
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|ГДЕ
	|	ДокументыФизическихЛицСрезПоследних.ЯвляетсяДокументомУдостоверяющимЛичность
	|	И ДокументыФизическихЛицСрезПоследних.Физлицо = &ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументыФизическихЛицСрезПоследних.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПаспортРФ.ВидДокументаФизЛица ЕСТЬ NULL 
	|			ТОГДА ДокументУдостоверяющийЛичность.ВидДокументаФизЛица
	|		ИНАЧЕ ПаспортРФ.ВидДокументаФизЛица
	|	КОНЕЦ КАК ВидДокументаФизЛица
	|ПОМЕСТИТЬ ВыбранныйВидДокумента
	|ИЗ
	|	ПаспортРФ КАК ПаспортРФ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ДокументУдостоверяющийЛичность КАК ДокументУдостоверяющийЛичность
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ВидДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК СерияДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК НомерДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыданДокументФизлица,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачиДокументаФизЛица,
	|	ДокументыФизическихЛицСрезПоследних.Представление КАК ПредставлениеДокументаФизЛица
	|ИЗ
	|	ВыбранныйВидДокумента КАК ВыбранныйВидДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
	|		ПО ВыбранныйВидДокумента.ВидДокументаФизЛица = ДокументыФизическихЛицСрезПоследних.ВидДокумента
	|ГДЕ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо = &ФизЛицо";
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДокДоверенность, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


// Возвращает структуру из настроек хранилища дополнительной обработки.
//
// Параметры:
//	ИмяФайла - поиск элемента справочника по имени файла 
//  ИмяСтруктуры - название структуры в структуре хранилища значений
// Возвращаемое значение:
//	Структура со значениями сохраненных настроек.
//
Функция ПолучитьНастройкиХранилища(ИмяСтруктуры,ИмяФайла="НастройкиХранилища.epf") экспорт
	ДополнительнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяФайла", имяФайла);		
	СтруктураХранилища=ДополнительнаяОбработка.ХранилищеНастроек.Получить();
	если типзнч(СтруктураХранилища)=тип("Структура") и СтруктураХранилища.Свойство(ИмяСтруктуры) тогда
		Возврат СтруктураХранилища[ИмяСтруктуры] ;
	конецесли;
	возврат неопределено;
КонецФункции

#КонецЕсли
